app/views/pages/partials/_index.html.erb

SELECT "pages".* FROM "pages"
SELECT COUNT(*) FROM "pages"
---
<% pages = Page.all %>

SELECT  1 AS one FROM "galleries" WHERE "galleries"."page_id" = $1 LIMIT 1  [["page_id", 1]]
SELECT "galleries".* FROM "galleries" WHERE "galleries"."page_id" = $1  [["page_id", 1]]
---
      <li class="uk-parent uk-nav-header uk-nav-divider"><%= link_to page.name, '#' %>
      <% if page.galleries.any? %>