app/views/galleries/partials/_show.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."gallery_id" = $1  [["gallery_id", 1]]
---
<div id="container">
  <% @gallery.photos.each do |photo| %>