app/controllers/galleries_controller.rb

    def set_gallery
      @gallery = Gallery.find(params[:id])
---
SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT 1  [["id", 1]]