app/controllers/pages_controller.rb

  def index
    @page = Page.all
---
SELECT "pages".* FROM "pages"
SELECT COUNT(*) FROM "pages"